---
kind: method
id: M:Autodesk.Revit.DB.SaveAsOptions.#ctor
source: html/6d630f06-c786-bb5b-98ee-d14147b7e4a0.htm
---
# Autodesk.Revit.DB.SaveAsOptions.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public SaveAsOptions()
```